; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	thermograph4 - mode
	thermograph2 - mode
	spectrograph1 - mode
	image3 - mode
	Star3 - direction
	Star4 - direction
	Star6 - direction
	GroundStation7 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star10 - direction
	GroundStation11 - direction
	Star5 - direction
	GroundStation1 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph2)
	(supports instrument2 image3)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
)
(:goal (and
	(have_image Star12 spectrograph1)
	(have_image Phenomenon13 image0)
	(have_image Planet14 thermograph2)
	(have_image Star15 image0)
	(have_image Planet16 thermograph2)
	(have_image Planet17 image3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (calibrate satellite0 instrument0 groundstation9)
   added: (calibrated instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 star12 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 star12)
   goals met: 0 of 6
4. (take_image satellite0 star12 instrument0 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 1 of 6
5. (turn_to satellite0 planet17 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet17)
   goals met: 1 of 6
6. (take_image satellite0 planet17 instrument0 image3)
   added: (have_image planet17 image3)
   goals met: 2 of 6
7. (turn_to satellite0 phenomenon13 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 6
8. (take_image satellite0 phenomenon13 instrument0 image0)
   added: (have_image phenomenon13 image0)
   goals met: 3 of 6
9. (turn_to satellite0 star15 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star15)
   goals met: 3 of 6
10. (take_image satellite0 star15 instrument0 image0)
   added: (have_image star15 image0)
   goals met: 4 of 6
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 6
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 6
13. (turn_to satellite0 groundstation0 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 6
14. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 4 of 6
15. (turn_to satellite0 planet14 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet14)
   goals met: 4 of 6
16. (take_image satellite0 planet14 instrument1 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 5 of 6
17. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 5 of 6
18. (take_image satellite0 planet16 instrument1 thermograph2)
   added: (have_image planet16 thermograph2)
   goals met: 6 of 6
